{
  "_name_or_path": "rdpahalavan/bert-network-packet-flow-header-payload",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Analysis",
    "1": "Backdoor",
    "2": "Bot",
    "3": "DDoS",
    "4": "DoS",
    "5": "DoS GoldenEye",
    "6": "DoS Hulk",
    "7": "DoS SlowHTTPTest",
    "8": "DoS Slowloris",
    "9": "Exploits",
    "10": "FTP Patator",
    "11": "Fuzzers",
    "12": "Generic",
    "13": "Heartbleed",
    "14": "Infiltration",
    "15": "Normal",
    "16": "Port Scan",
    "17": "Reconnaissance",
    "18": "SSH Patator",
    "19": "Shellcode",
    "20": "Web Attack - Brute Force",
    "21": "Web Attack - SQL Injection",
    "22": "Web Attack - XSS",
    "23": "Worms"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Analysis": 0,
    "Backdoor": 1,
    "Bot": 2,
    "DDoS": 3,
    "DoS": 4,
    "DoS GoldenEye": 5,
    "DoS Hulk": 6,
    "DoS SlowHTTPTest": 7,
    "DoS Slowloris": 8,
    "Exploits": 9,
    "FTP Patator": 10,
    "Fuzzers": 11,
    "Generic": 12,
    "Heartbleed": 13,
    "Infiltration": 14,
    "Normal": 15,
    "Port Scan": 16,
    "Reconnaissance": 17,
    "SSH Patator": 18,
    "Shellcode": 19,
    "Web Attack - Brute Force": 20,
    "Web Attack - SQL Injection": 21,
    "Web Attack - XSS": 22,
    "Worms": 23
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.2",
  "vocab_size": 28996
}
